{
 "basics": {
    "name": "Richard H. Moore Jr.",
    "label": "Senior Software Engineer",
    "summary": "Over 30 years of software engineering experience. Achieved the following:  \n\n&nbsp;&nbsp;&bull; In all my years I have worn many hats such as software engineer, team lead, architect, analyst, DB engineer, and DevOps engineer.\n\n &nbsp;&nbsp;&bull; Worked as a full-stack web developer in both Linux/Unix and Microsoft platforms.\n\n &nbsp;&nbsp;&bull; Worked with MSSQL, MySQL, and other databases. Also used Code-First technology (EntityFramework, Telerik ORM) with some projects.\n\n &nbsp;&nbsp;&bull; Past projects also include microservices, multi-threading, multi-platform, hardware integration (IoT), and third-party integration ranging from web services to direct software module installation.\n\n &nbsp;&nbsp;&bull; Worked in different industries such as the financial (credit card processing), employee benefits, logistics (shipping), and defense industries.\n\n &nbsp;&nbsp;&bull; Held top secret and secret clearances with the government.\n\n &nbsp;&nbsp;&bull; Successfully worked with remote teams and globally distributed team members.\n\n &nbsp;&nbsp;&bull; Experienced with many development methodologies such as Waterfall, Scrum, and Kanban.\n\n &nbsp;&nbsp;&bull; Used different agile methods such as Continuous Integration (CI), Test Driven Development (TDD), and Pair Programming.\n\n &nbsp;&nbsp;&bull; Established DevOps tools and processes within companies.\n\n &nbsp;&nbsp;&bull; Trained and mentored teams in DevOps tools and processes as well as Scrum methodology.\n\n &nbsp;&nbsp;&bull; Masters in Business Administration (MBA), Certified Scrum Master (CSM), Certified Scrum Developer (CSD), and Advanced Certified Scrum Developer (A-CSD)",
	"website": "https://techmooresolutions.com",
    "email": "richard.h.moore.jr@gmail.com",
	"phone": "(951) 765-7531",
    "location": {
      "address": "9079 Old Castle Rd.",
      "city": "Valley Center",
	  "postalCode": "CA 92082",
      "countryCode": "US"
    },
    "profiles": [
      {
        "network": "linkedin",
		  "username": "richard-moore-9b238723",
		  "url": "https://www.linkedin.com/in/richard-moore-9b238723/"
      }
    ]
  },

  "education": [
    {
      "endDate": "2008-04-01",
      "startDate": "2005-10-01",
      "area": "Business Administration",
      "studyType": "Masters",
      "institution": "University of Phoenix",
	  "location": {
		  "city": "Phoenix, AZ",
		  "countryCode": "US"
		}
    },
	{
      "endDate": "1996-05-01",
      "startDate": "1991-08-01",
      "area": "Economics",
      "studyType": "Bachelors of Arts",
      "institution": "Humboldt State University",
	  "location": {
		  "city": "Arcata, CA",
		  "countryCode": "US"
		}
    }
  ],
  "references": [],
  "skills": [
    {
      "keywords": [
        "C#",
        "Web Services REST/SOAP",
        "ASP.NET (WebForms/MVC/MVVM)",
        ".NET Core",
        "HTML",
        "JSON",
        "XML",
        "SQL",
        "Python",
        "Perl",
        "CSS",
        "Javascript",
        "JQuery",
        "LINQ",
        "C/C++",
        "VB.NET",
        "VB6"
      ],
      "level": "Proficient",
      "name": "Languages"
    },
	{
      "keywords": [
        "MSSQL",
		"MySQL",
        "EntityFramework",
        "Telerik ORM",
        "Oracle"
      ],
      "level": "Proficient",
      "name": "Databases/Code-First"
    },
    {
      "keywords": [
        "Visual Studio",
        "JIRA/Confluence/Bitbucket",
		"TFS",
        "Rational Team Concert (RTC)",
        "TeamCity",
        "Jenkins",
		"Git",
		"NuGet"      ],
      "level": "Proficient",
      "name": "DevOps/Tools"
    }
  ],
  "awards": [
    {
      "title": "Eagle Scout",
      "awarder": "Boy Scouts of America"
    }
  ],
  "certificates": [{
    "name": "Python",
    "date": "2003-06-01",
    "issuer": "UCSD Extension",
    "url": "https://extendedstudies.ucsd.edu/"
  },
    {
      "name": "ASP.NET MVC",
      "date": "2017-06-01",
      "issuer": "UCSD Extension",
      "url": "https://extendedstudies.ucsd.edu/"
    },
    {
      "name": "Certified Scrum Master (CSM)",
      "date": "2011-04-11",
      "issuer": "Scrum Alliance",
      "url": "https://scrumalliance.org/"
    },
    {
      "name": "Certified Scrum Developer (CSD)",
      "date": "2011-09-02",
      "issuer": "Scrum Alliance",
      "url": "https://scrumalliance.org/"
    },
    {
      "name": "Advanced Certified Scrum Developer",
      "date": "2021-04-15",
      "issuer": "Scrum Alliance",
      "url": "https://scrumalliance.org/"
    }],
  "work": [
    {
      "summary": "The Maryland Department of Veterans and Military Families (DVMF) is updating its current site to serve veterans and their families more effectively.",
      "website": "https://www.usdigitalresponse.org/",
      "company": "US Digital Response",
      "pinned": false,
      "location": "San Diego, CA",
      "position": "Senior Software Engineer",
      "startDate": "2025-02-21",
      "endDate": "2025-07-07",
      "highlights": [
        "Led the development of new SharePoint 2019 web pages, enhancing site usability and accessibility to better support veterans and their families, resulting in improved user engagement and satisfaction.",
        "Collaborated within a four-person team and coordinated with departmental stakeholders to ensure project alignment with organizational goals and timelines.",
        "Designed and implemented SharePoint templates to streamline content creation and maintain consistency across pages.",
        "Delivered weekly progress presentations to stakeholders, ensuring transparency, maintaining project momentum, and incorporating feedback into iterative improvements."
      ],
      "keywords": ["Sharepoint", "Lead"]
    },
    {
      "summary": "The city of Jackson, MS, used Tyler Munis to facilitate vendor invoicing. They sought to enhance their ERP by automating the allocation of vendor invoices to the correct department, a process that currently required manual intervention.",
      "website": "https://www.usdigitalresponse.org/",
      "company": "US Digital Response",
      "pinned": false,
      "location": "San Diego, CA",
      "position": "Technical Advisor",
      "startDate": "2024-05-03",
      "endDate": "2024-09-25",
      "highlights": [
        "Diagnosed and resolved a critical breakdown in the City’s vendor payment and invoice processing workflow by evaluating and optimizing its .NET-based invoicing software.",
        "Recommended and implemented a cost-effective solution to align the ERP system (Tyler Munis) with municipal payment processes, improving accuracy and reducing delays.",
        "Collaborated with stakeholders, including representatives from the Harvard Kennedy School, to ensure alignment with best practices in public financial management.",
	"Applied Agile development practices, including Test-Driven Development (TDD) and Continuous Integration (CI), to deliver high-quality, continuously tested code in a multi-language environment (C#).",
	"Leveraged strong Object-Oriented Design (OOD) principles to refactor complex, multi-technology codebases, improving maintainability and scalability."

      ],
      "keywords": [".NET", "Scrum", "Lead"]
    },
    {
      "summary": "Acuity International operates multiple web applications connecting employers, employees, and doctors, facilitating job-specific medical services. These web applications are complex, having been around for decades, and require constant maintenance and updates to the applications and their respective technologies.",
	  "website": "https://acuityinternational.com/",
      "company": "Acuity International ",
      "pinned": false,
      "location": "Cape Caneveral, FL",
      "position": "Senior Software Engineer",
      "startDate": "2022-02-28",
      "endDate": "2024-03-01",
      "highlights": [
        "Served as a Full-Stack Engineer for Acuity International, leading modernization efforts across multiple web-based applications supporting occupational medical services for corporate clients.",
        "Navigated and maintained a complex tech stack spanning legacy ASP/AccessDB, modern C# .NET, SQL Server, AngularJS, and Knockout.js, ensuring seamless functionality across all layers of the application.",
        "Authored a comprehensive technical specification for migrating a core application from Legacy ASP/AccessDB to C# .NET and SQL Server, laying the foundation for long-term scalability and maintainability.",
        "Converted and enhanced key features, such as the Hearing Conservation system within Acuity's WebMTS web application, transitioning from outdated legacy components to modern .NET architecture using the MVVM pattern.",
        "Collaborated with external consultants on the Randomwhere system within Acuity's WebMTS web application, providing project scoping guidance and initiating early-stage development before handing off to the agency for completion.",
        "Led security audits and updates across all active projects, mitigating vulnerabilities and ensuring alignment with modern security standards.",
        "Integrated Acuity's WebMETS web application with Costpoint accounting software, improving financial operations and invoice processing efficiency for the Finance department.",
        "Contributed to all facets of application development—front-end, backend, and business logic—delivering enhancements and resolving critical bugs in a fully remote environment.",
	"Applied Agile development practices, including Test-Driven Development (TDD) and Continuous Integration (CI), to deliver high-quality, continuously tested code in a multi-language environment (C++, C#, VB6).",
	"Leveraged strong Object-Oriented Design (OOD) principles to refactor complex, multi-technology codebases, improving maintainability and scalability."
      ],
      "keywords": ["C#","MSSQL", "ASP.NET", "MVC","REST Web Services", "SOAP Web Services", "Scrum", ".NET Core","Visual Studio", "Entity Framework", "AngularJS", "KnockoutJS", "Javascript"]
    },
	{
      "summary": "The city of Memphis, GA, was building a web application connecting citizens with various housing programs the city provided. The web application asked questions and offered specific housing options based on the answers given.",
	  "website": "https://www.usdigitalresponse.org/",
      "company": "US Digital Response",
      "pinned": false,
      "location": "San Diego, CA",
      "position": "Technical Manager",
      "startDate": "2021-04-23",
      "endDate": "2022-02-01",
      "highlights": [
	"Led architecture and full-stack development of a web application for a nonprofit initiative spanning three organizations, designed to assess applicant eligibility and connect individuals with essential community resources.",
    "Designed and deployed the application infrastructure using AWS Lightsail, configuring a scalable Ubuntu virtual server environment for production deployment.",
	"Developed the solution end-to-end using C# ASP.NET Core, JavaScript, CSS, and PostgreSQL, ensuring cross-functional integration and a user-friendly interface.",
        "Served as Technical Manager and mentor to junior developers, guiding best practices, reviewing code, and fostering a collaborative development environment in a fully remote setting."
      ],
      "keywords": ["C#", "Scrum", "AWS", "Python", "Postgres", "Lead", "Manager"]
    },
	{
      "summary": "Techmoore Solutions is my own contracting business",
	  "website": "https://techmooresolutions.com",
      "company": "Techmoore Solutions",
      "pinned": false,
      "location": "San Diego, CA",
      "position": "Senior Software Engineer",
      "startDate": "2019-05-01",
      "endDate": "2019-07-01",
      "highlights": [
        "Developed a C# application to automate the processing of over 1,200 COVID-19 waiver PDFs for the Escondido Soccer Club, significantly reducing manual effort by categorizing documents by type, language, and team.",
	"Created a custom Chrome Extension using JavaScript and CSS to enhance usability and visual presentation of Haynes online manuals, tailoring the interface to meet specific user needs.",
      "Operated as an independent contractor, delivering targeted solutions that improved efficiency and user experience for niche technical challenges."
      ],
      "keywords": ["C#.NET", "CSS", "Manager"]
    },
    {
      "highlights": [
        "Engineered and maintained backend services for IoT-based smart parking meter systems, focusing on session handling and secure financial transaction processing.",

        "Designed and implemented microservices architecture using C#, MSSQL, and Quartz.NET to manage financial transactions, including dynamic service updates via Reflection tied to database changes.",

        "Built and deployed WCF web services to support integration with multiple credit card processors, enhancing system flexibility and third-party compatibility.",

        "Developed a secure settlement processor for Barclaycard, automating file generation, transmission via SSL FTP, and response parsing to streamline reconciliation workflows.",

        "Led CI/CD initiatives for the EMV project by creating Jenkins-based build and packaging pipelines using NuGet, improving deployment reliability and developer efficiency.",

        "Modernized legacy codebases by converting .NET Framework projects to .NET Core, enhancing performance, maintainability, and future scalability.",

        "Provided technical support and integration guidance to third-party development teams, ensuring smooth onboarding of new processors and payment features.",
	"Applied Agile development practices, including Test-Driven Development (TDD) and Continuous Integration (CI), to deliver high-quality, continuously tested code in a multi-language environment (C++, C#).",
	"Leveraged strong Object-Oriented Design (OOD) principles to refactor complex, multi-technology codebases, improving maintainability and scalability."
      ],
      "summary": "The company produces “smart” parking meters (IoT). Worked on session and transaction services backend logic. The work entailed adding new credit card processors, supporting third-party development teams, and other payment processing functions such as EMV support. All development is using C#.Net and MSSQL.",
      "website": "https://ipsgroupinc.com",
      "pinned": false,
	  "location": "San Diego, CA",
      "company": "IPS Group Inc.",
      "position": "Senior Software Engineer",
      "startDate": "2016-10-01",
      "endDate": "2019-05-01",
	  "keywords": ["C#","MSSQL","REST Web Services", "Scrum", "microservices", "WCF", "continuous integration", "NuGet", "EMV", "Jenkins", "Jira","Confluence", "Bitbucket", ".NET Core", "IoT"]
    },
    {
      "highlights": [
        "Brought in to resolve critical personnel and workflow issues on the TORIS contract supporting Navy training systems, ensuring continuity and project stability for defense contractor Serco.",

        "Scoped and clearly defined the responsibilities of the database engineer role, reducing ambiguity and preparing for a seamless transition to the incoming contract holder.",

        "Documented the existing database infrastructure and processes to support knowledge transfer and long-term system maintainability.",

        "Successfully navigated and managed complex interpersonal challenges, fostering collaboration and restoring productivity in a high-pressure environment."
      ],
      "pinned": false,
      "summary": "Serco is a defense contractor managing the TORIS contract. The TORIS contract facilitated some training of Navy personnel. The project had labor issues with the database personnel. I was tasked with helping to facilitate the issues and documenting their process.",
      "website": "http://www.serco.com",
      "company": "Serco",
      "position": "Technical Business Analyst",
      "startDate": "2016-01-01",
	  "endDate": "2016-03-01",
	  "keywords": ["C#","MSSQL","Lead"]
    },
    {
      "highlights": [
        "Contributed to a high-performing Scrum team at BeneTrac, consistently meeting contractual sprint goals from the time of joining,",

        "Recognized by management for sustained team success and cross-functional collaboration,",

        "Earned strong peer support and retention on the team after management attempted to reassign me, highlighting my value and influence,",

        "Developed and maintained application features using VB (Classic ASP), C# (ASP.NET), and SQL Server, applying Test Driven Development (TDD) and peer code reviews for quality assurance,",

        "Led a key project to integrate third-party vendors with the BeneTrac platform, architecting and developing a secure solution using HTML5, CSS3, jQuery, RESTful web services, C#, and SQL Server.",

        "Implemented mutual authentication to secure communication channels between external systems and the BeneTrac application, ensuring data privacy and compliance.",
	"Applied Agile development practices, including Test-Driven Development (TDD) and Continuous Integration (CI), to deliver high-quality, continuously tested code in a multi-language environment (C#, VB6).",
	"Leveraged strong Object-Oriented Design (OOD) principles to refactor complex, multi-technology codebases, improving maintainability and scalability."
      ],
      "summary": "BeneTrac provides a web-based platform that enables companies and their employees to manage HR benefits through a user-friendly interface.",
      "website": "http://www.benetrac.com",
      "company": "Benetrac",
      "position": "Senior Software Engineer",
      "startDate": "2014-10-01",
      "endDate": "2015-12-01",
	  "keywords": ["ASP.NET", "C#", "VB6", "JQuery", "CSS", "MSSQL", "HTML5", "REST Web Services", "Scrum", "TDD", "peer review", "Lead"]
    },
    {
      "highlights": [
        "Refactored and organized commercial EDI translation software under a Content Management System, improving maintainability and scalability of the codebase.",

        "Upgraded the company's commercial software to support both 32-bit and 64-bit platforms, expanding compatibility and future-proofing deployments.",

        "Modernized legacy systems by converting Classic ASP code written in VB on the JMPS (Joint Mission Planning Systems) program to C# with ASP.NET, enhancing performance and security.",

        "Applied Test Driven Development (TDD) and conducted regular peer reviews to ensure code quality, reliability, and adherence to development standards.",

        "Segmented core components of the JMPS application, enabling modular development and simplifying future maintenance and feature integration.",
	"Applied Agile development practices, including Test-Driven Development (TDD) and Continuous Integration (CI), to deliver high-quality, continuously tested code in a multi-language environment (C#, VB6).",
	"Leveraged strong Object-Oriented Design (OOD) principles to refactor complex, multi-technology codebases, improving maintainability and scalability."

      ],
      "summary": "Avatar Partners was contracted to help decouple and update segments of the Joint Mission Planning Systems (JMPS) application. This application is used by both the Navy and Air Force to plan flight-based missions.",
      "website": "http://www.avatarpartners.com",
      "company": "Avatar Partners",
      "position": "Senior Software Engineer",
      "endDate": "2014-08-01",
      "startDate": "2014-04-01",
	  "keywords": ["ASP.NET", "C#", "VB6", "JMPS", "Kanban", "Scrum", "TDD", "TFS", "Jira", "Confluence", "Lead"]
    },
    {
      "highlights": [
        "Brought in to support Teradata’s Enabling Solutions group in architecting and implementing a Continuous Integration and Deployment (CI/CD) framework modeled after IBM’s Build, Deploy, Test, and Release (BDTR) methodology.",

        "Led the architecture, resource planning, estimation, and timeline development for the CI/CD initiative, utilizing TeamCity, JIRA, and a custom deployment environment.",

        "Authored a detailed proposal for executive management outlining the vision, scope, and benefits of the CI/CD framework.",

        "Designed and developed a data warehouse to enable digital analytics on the CI process by importing TeamCity data via REST APIs into SQL Server using C#, LINQ, and Entity Framework.",

        "Built the import engine to support traceability and automation, enabling insights into build and deployment trends across the organization.",

        "Followed Test Driven Development (TDD) practices and participated in peer code reviews to maintain high-quality, maintainable code."
      ],
      "summary": "I was brought in specifically for my DevOps experience to help architect a new CI/CD system. ",
      "website": "http://teradata.com",
      "company": "Teradata",
      "position": "Senior Software Engineer/Enterprise Continuous Integration Engineer",
      "startDate": "2013-08-01",
	  "endDate": "2014-03-01",
	  "keywords": ["Java", "TeamCity", "Jira", "TDD", "C#", "LINQ", "REST", "MSSQL", "Entity Framework", "Lead"]
    },
    {
      "highlights": [
        "Led the development and enhancement of a shipping logistics web application used by external companies, recommending and implementing improvements to optimize performance and usability.",

        "Developed and maintained both new and existing functionality using C# and Oracle in a Test Driven Development (TDD) environment with peer reviews.",

        "Designed and implemented web services using both REST and SOAP to expand system interoperability and integration capabilities.",

        "Streamlined development workflows by introducing structured processes in JIRA for bug tracking, time management, and issue resolution.",

        "Established knowledge management best practices using Confluence to centralize documentation and improve team collaboration.",

        "Collaborated with the team to enhance build and release processes, improving deployment reliability and reducing cycle time.",

        "Architected and scoped technical solutions tailored to customer needs, including effort estimation and resource planning.",

        "Led the hiring and onboarding of consultants and employees to scale the development team and support long-term project goals."
      ],
      "summary": "NTE was a small company that produced and maintained a web application serving shipping logistics to its clientele.",
      "website": "http://www.nte.com",
      "company": "NTE",
      "position": "Director of Application Development",
      "startDate": "2012-06-01",
      "endDate": "2013-08-01",
	  "keywords": ["C#", "ASP.NET", "Oracle", "TDD", "CSS", "LINQ", "REST", "Telerik ORM", "Telerik RadGrid", "VB6", "ASP", "Lead", "Manager"]
    },
    {
      "highlights": [
        "Contributed to the Joint Mission Planning System (JMPS), a large-scale, multi-branch defense program with over 100 developers and 1,500+ projects, involving technologies such as C++, C#, and VB6,",

        "Modernized legacy components by implementing new functionality using SQL Server, WCF, and .NET 3.5, while maintaining and refactoring critical legacy code in VB6 and C++,",

        "Architected and led the implementation of a Continuous Integration (CI) system for 1,500+ projects using Jenkins, NUnit, ClearCase, Visual Build Pro, and InstallShield, reducing build times and enabling automated testing and deployment,",

        "Designed and implemented a Perl-based automation system that dynamically created Jenkins projects for each solution by parsing the source tree structure,",

        "Led and mentored a team of 5 engineers (remote and on-site) through successful build integration and release cycles, consistently delivering on tight deadlines without delays,",

        "Served as technical mentor to all new JMPS build engineers, providing onboarding, process documentation, and ongoing support,",

        "Integrated software from multiple external vendors into the JMPS build process, resolving complex compatibility and dependency issues,",

        "Led the architecture and prototyping of a segmenting system for JMPS that tracked module dependencies and generated automated build scripts, enabling better modularity and reporting,",

        "Supervised a developer to implement the segmenting solution and conducted training seminars on building JMPS 1.4.1, producing documentation later adopted as the standard for all future JMPS build guides,",

        "Developed and documented custom performance counters and a logging library using Microsoft Enterprise Libraries, and integrated logging into a custom MMC snap-in interface,",

        "Demonstrated logging and performance metrics to stakeholders and the customer, improving observability and monitoring of the application,",

        "Implemented and documented integration of Microsoft Sync Framework with the JMPS Meta Data Broker (MDB) for offline data synchronization analysis,",

        "Collaborated with the Modeling & Simulation group to measure JMPS performance using OPNET, providing digital analysis of system efficiency and bottlenecks,",

        "Designed and delivered a custom Agile training course to prepare team members for Professional Scrum Master I certification and to implement Agile practices in a non-Agile environment,",

        "Implemented unit testing support via NUnit and promoted Test Driven Development (TDD) practices across the development team,",

        "Contributed to a $5M MSP proposal as Subject Matter Expert (SME) on Agile/Scrum practices, collecting productivity metrics and authoring key sections of the management proposal, which received the highest possible rating,",

        "Completed advanced training courses including Architecting Enterprise Solutions, Enterprise Architecture Application Training, and White Hat IT Security, strengthening enterprise-level development and security knowledge,",

        "Consistently presented project progress and technical findings to internal and external stakeholders, organizing and facilitating live demonstrations,",
	"Applied Agile development practices, including Test-Driven Development (TDD) and Continuous Integration (CI), to deliver high-quality, continuously tested code in a multi-language environment (C++, C#, VB6).",
	"Leveraged strong Object-Oriented Design (OOD) principles to refactor complex, multi-technology codebases, improving maintainability and scalability."

      ],
      "summary": "BAE Systems is a government contracting company. I initially worked on the JMPS, Joint Mission Planning System, program, as well as worked on various proposal teams alongside other programs, providing software and continuous integration efforts.",
      "website": "http://www.baesystems.com",
      "company": "BAE Systems",
      "position": "Senior Software Engineer",
      "startDate": "2008-09-01",
	  "endDate": "2012-03-01",
	  "keywords": ["C#", "VB6", "C++", "NUnit", "Perl","Jenkins", "ClearCase", "Visual BuildPro", "TDD", "WCF", "Scrum", "Lead"]
    },
    {
      "highlights": [
        "Architected and developed a new database to store and manage genetic research data, enabling structured access to previously unorganized scientific material.",

        "Collaborated closely with a business consultant to define operational workflows and identify automation opportunities for key business processes.",

        "Supported a startup environment as one of the first two contributors, helping lay the technical and operational foundation of the company."
      ],
      "summary": "Existence Genetics was a startup that mapped DNA information to genetic research. ",
      "company": "Existence Genetics",
      "position": "Architect/Senior Software Engineer",
      "startDate": "2008-03-01",
      "endDate": "2008-09-01",
	  "keywords": ["C#", "MSSQL", "Lead"]
    },
    {
	"highlights": [
      "Served as Technical Lead and Application Developer for a web-based system supporting both deployed and non-deployed Marines with scenario-based checklists, readiness assessments, and inventory reporting.",

      "Managed the full software development lifecycle, from requirements gathering and architecture through development, testing, deployment, and training.",

      "Led and mentored a development team, providing architectural direction, enforcing coding standards, and implementing best practices for accountability and maintainability.",

      "Redesigned the application’s technical architecture and database schema, introducing n-tier principles, object-oriented design, and improved referential integrity to enhance scalability and performance.",

      "Took over the project mid-stream, refactored the codebase and database, implemented version control and bug tracking systems, and established structured deployment procedures.",

      "Interfaced directly with the customer to gather requirements, define scope, estimate effort, and set cost expectations.",

      "Delivered monthly status reports, maintained detailed project documentation, and conducted training sessions for end users on new functionality.",

      "Developed the application using VB.NET on the .NET 1.1 framework with SQL Server 2000 as the backend, utilizing Visual Studio, Visual SourceSafe, and Visio for design and development.",

      "Played a key role in the successful renewal of the project contract by collaborating with both the customer and internal team to define the annual scope and deliverables."
    ],
      "summary": "EG&G Technical Services is a government contractor. I was employed to lead and develop a web-based application for the Marines that provided detailed instruction checklists, not only guiding Marines but also allowing them to report their capability status.",
      "company": "EG&G Technical Services",
      "position": "Senior Software Engineer",
      "endDate": "2007-12-01",
      "startDate": "2005-08-01",
	  "keywords": ["C#", "VB.NET", "MSSQL", "ASP.NET", "Lead"]
    }
  ],
  "interests": []
}
